@extends('layouts.main')

@section('content')
Гнучкість і налаштування сітки

Давайте обговоримо, як зробити так, щоб верстка за допомогою bootstrap стала ще більш унікальною і придатною під наші потреби. Для цього ми використовуємо Sass – потужний препроцесор CSS, який Bootstrap інтегрував для спрощення налаштування.

    Змінні Sass – це наче певні ярлики, які ви можете присвоїти властивостям, а потім використовувати їх замість фіксованих значень. Наприклад, можна створити змінну для основного кольору і потім використовувати її в усьому проєкті. Якщо буде потрібно змінити колір, достатньо буде оновити значення змінної, і воно автоматично застосується до всіх елементів, що використовують цю змінну.

    Карти (Maps) надають зручний спосіб зберігання даних у вигляді пар ключ-значення. У Bootstrap, наприклад, карти використовуються для зберігання інформації про медіазапити (брейкпойнти) та інші значущі параметри. Це робить налаштування адаптивності простішим і гнучкішим.

    Міксини (Mixins) – певний набір інструкцій, який ви можете використовувати у своєму проекті. Bootstrap надає безліч міксинів для роботи з сіткою. Ви можете застосувати міксин, щоб створити власні класи для елементів сітки, задавши їм нестандартні ширину, відступи та багато іншого.
   
@endsection